#include <windows.h>
#include "res/resource.h"
#include "Units.h"
#include <stdio.h>

extern HWND hMainDlg;
extern int	CurrentIndex;
extern BOOL bFiz;

const char uCount[12]={42,11,17,29,9,36,23,10,6,4,4,24};
const char uInit[12]={21,5,9,2    ,4,21,11,7,0,3,2,0};

const UNIT Units[]={
//Длина
	{"Ангстрем",1e10,1},
	{"Аршин",1.406074, 1},
	{"Астрономическая единица",6.684587e-12, 1},
	{"Барликорн",117.6470588, 1},
	{"Верста",0.0009373828, 1},
	{"Вершок",22.49719, 1},
	{"Дюйм",39.37007874, 1},
//	{"Кабельтов США",0.004555808656, 1},
	{"Кабельтов",0.004556722, 1},
	{"Калибр",3.94E3, 1},
	{"Километр",0.001, 1},
	{"Кубит",2.086463, 1},
	{"Косая сажень",0.4032258, 1},
	{"Ладонь",9.84252, 1},
	{"Лига законная US",0.0002071237, 1},
	{"Лига морская",0.0001798561151, 1},
	{"Линия",472.4409, 1},
	{"Линк(геодезический)",4.97, 1},
	{"Линк(строительный)",3.333333333, 1},
	{"Малый кабельтов",0.005399568, 1},
	{"Маховая сажень",0.5681818, 1},
	{"Межевая верста",0.0004686914, 1},
	{"Метр",1, 1},
	{"Микрон",1E6, 1},
	{"Миля законная US",0.0006213712, 1},
	{"Миля морская",0.0005399568, 1},
	{"Мил",39400, 1},
	{"Миллиметр",1000, 1},
	{"Морская сажень",0.5468067, 1},
	{"Парсек",3.240779e-17,1},
	{"Пункт (типограф.)",2834.646, 1},
	{"Пядь",5.624297, 1},
	{"Сажень",0.4686914, 1},
	{"Сантиметр",100, 1},
	{"Световая минута",5.559402e-11, 1},
	{"Световая секунда",3.335641e-9, 1},
	{"Точка",2849.002849, 1},
	{"Световой год",1.057023e-16, 1},
	{"Фарлонг",0.00497097, 1},
	{"Фут",3.280839895, 1},
	{"Цициро (типограф.)",236.2205, 1},
	{"Чейн",0.0497097, 1},
	{"Ярд",1.093613298, 1},
//Площадь
	{"Акр",2.469135802e-004, 1},
	{"Ар",0.0109, 1},
	{"Гектар", 0.000109,1},
	{"Квадратный дюйм", 1550.387597,1},
	{"Квадратный километр", 1.e-006,1},
	{"Квадратный метр", 1,1},
	{"Квадратный миллиметр", 1000000,1},
	{"Квадратный ярд", 1.196172249,1},
	{"Руд", 9.900990099e-004,1},
	{"Тауншип (США)", 1.072501073e-008,1},
	{"Хайда (Англия)", 3.086419753e-006,1},
//Объем
	{"Баррель нефтяной (США)", 6.29,1},
	{"Баррель сухой (США)", 8.65,1},
	{"Бушель (Англия)", 27.5,1},
	{"Бушель (США)", 28.4,1},
	{"Ведро", 81.3,1},
	{"Галлон (Англия)", 220,1},
	{"Корд большой", 0.2759381898,1},
	{"Корд малый", 0.2802690583,1},
	{"Кубический дюйм", 61012.81269,1},
	{"Кубический метр", 1,1},
	{"Пинта (Англия)", 1.76e3,1},
	{"Пинта жидкостная (США)", 2.11e3,1},
	{"Пинта сухая US", 1.82e3,1},
	{"Стек", 0.3289473684,1},
	{"Тонна регистровая", 0.3533568905,1},
	{"Унция жидкостная (Англия)", 3.52e4,1},
	{"Унция жидкостная (США)", 3.38e4,1},
//Масса
	{"Блэнк", 3571428.571,1},
	{"Вей", 9.842519685e-006,1},
	{"Грамм", 1,1},
	{"Гран", 15.43209877,1},
	{"Дойт", 7407.407407,1},
	{"Драхма", 0.5643340858,1},
	{"Золотник", 0.2344253,1},
	{"Карат", 5,1},
	{"Карат (Англия)", 4.878049,1},
	{"Квартер длинный", 7.874015748e-005,1},
	{"Квартер короткий", 8.818342152e-005,1},
	{"Квартерн английский", 6.329113924e-004,1},
	{"Квинтал (Англия)", 1.96842334e-005,1},
	{"Квинтал (США)", 2.204634141e-005,1},
	{"Килограмм", 1.e-003,1},
	{"Клов (Англия)", 3.149606299e-004,1},
	{"Лот", 0.07814178,1},
	{"Майт", 308.6419753,1},
	{"Миллиграмм", 1000,1},
	{"Пеннивейт", 0.6430868167,1},
	{"Пириот", 148148.1481,1},
	{"Пуд",0.00006104819755,1},
	{"Стоун", 0.000157473, 1},
	{"Тод (Англия)", 7.874015748e-005,1},
	{"Тонна", 1.e-006,1},
	{"Унция (США)", 0.03527396,1},
	{"Унция", 3.215434084e-002,1},
	{"Фунт (США)", 0.002204623,1},
	{"Фунт", 2.679528403e-003,1},

//Скорость
	{"Километр в минуту", 0.06,1},
	{"Километр в секунду", 0.001,1},
	{"Километр в час", 3.6,1},
	{"Метр в минуту", 60,1},
	{"Метр в секунду", 1,1},
	{"Метр в час", 3.6E3,1},
	{"Миля в секунду", 0.0006213712,1},
	{"Миля в час", 2.236936,1},
	{"Узел", 1.943845,1},
//Жидкости
	{"Амфора", 0.03829657,1},
	{"Баррель для жидкостей (Англия)", 6.112469438e-003,1},
	{"Баррель для жидкостей (США)", 8.389261745e-003,1},
	{"Баррель для сырой нейти (Англия)", 6.289782877e-003,1},
	{"Баррель для сырой нефти (США)", 7.195797654e-003,1},
	{"Баррель", 7.112375533e-003,1},
	{"Бат", 2.036784325e-003,1},
	{"Ведро", 0.08130081,1},
	{"Галлон (Англия)", 0.2199736032,1},
	{"Галлон (США)", 0.2642007926,1},
	{"Гектолитр", 10,1},
	{"Декалитр", 100,1},
	{"Джилл, гилл (Англия)", 7.042253521,1},
	{"Джилл, гилл (США)", 8.474576271,1},
	{"Драхма жидкая (Англия)", 281.6901408,1},
	{"Драхма жидкая (США)", 337.8378378,1},
	{"Жидкая унция (Англия)", 35.21126761,1},
	{"Жидкая унция (США)", 33.81805884,1},
	{"Кварта (Англия)", 0.8771929825,1},
	{"Кварта (США)", 1.057082452,1},
	{"Килдеркин", 1.222493888e-002,1},
	{"Литр", 1,1},
	{"Миллилитр", 1000,1},
	{"Миним", 16230730,1},
	{"Пайп", 2.094986697e-003,1},
	{"Пинта (Англия)", 1.754385965,1},
	{"Пинта (США)", 2.127659574,1},
	{"Потл", 0.4405286344,1},
	{"Рюмка", 17.6056338,1},
	{"Столовая ложка", 70.42253521,1},
	{"Фиркин", 2.754820937e-002,1},
	{"Хозхед", 4.189885616e-003,1},
	{"Чайная ложка", 227.2727273,1},
	{"Чарка", 8.130081,1},
	{"Шкалик", 16.26016,1},
	{"Штоф(кружка)", 0.8130081,1},
//Меры сыпучих тел
	{"Баррель (Англия)", 6.112469438e-003,1},
	{"Баррель (США)", 8.52514919e-003,1},
	{"Бушель (Англия)", 2.751031637e-002,1},
	{"Бушель (США)", 2.840909091e-002,1},
	{"Ведро", 0.08130081,1},
	{"Галлон (Англия)", 0.2199736032,1},
	{"Галлон (США)", 0.2642007926,1},
	{"Гарнец", 0.3048966,1},
	{"Кварта (Англия)", 0.8771929825,1},
	{"Кварта (США)", 0.9082652134,1},
	{"Квартер", 3.436426117e-003,1},
	{"Литр", 1,1},
	{"Пек (Англия)", 0.113507378,1},
	{"Пек (США)", 0.1298701299,1},
	{"Пинта (Англия)", 1.76056338,1},
	{"Пинта (США)", 1.814882033,1},
	{"Сак (Англия)", 9.165902841e-003,1},
	{"Стакан", 4.226753,1},
	{"Столовая ложка", 67.62804,1},
	{"Страйк (Англия)", 1.374948439e-002,1},
	{"Чайная ложка", 202.8841,1},
	{"Челдрон (Англия)", 7.886435331e-004,1},
	{"Четверик", 0.03811208,1},
//Давление
	{"Атмосфера (тех)", 0.001359506,1},
	{"Атмосфера (физ)", 0.001315786,1},
	{"Бар", 0.00133322,1},
	{"Дюйм водяного столба", 0.5352534,1},
	{"Киллограмм силы на кв. сантиметр", 1.333333e-003,1},
	{"Киллопаскаль", 0.1333333,1},
	{"Миллибар", 1.33322,1},
	{"Миллиметр ртутного столба", 1,1},
	{"Паскаль", 133.322,1},
	{"Фунт сила на кв. дюйм", 0.01933672,1},
//Мощность
	{"Ватт", 1,1},
	{"Каллория в секунду", 0.2388459,1},
	{"Котловая лошадиная сила", 0.0001019589,1},
	{"Лошадиная сила", 0.001341022,1},
	{"Метрическая лошадиная сила", 0.00135962,1},
	{"Электрическая лошадиная сила", 0.00134048,1},
//Температура
	{"Градус Фаренгейта", 0,3},
	{"Градус Кельвина", 273,2},
	{"Градус Реомюра", 0,4},
	{"Градус Цельсия", 1,1},
//Сист.счисления
	{"Двоичная", 2,5},
	{"Восмеричная", 8,5},
	{"Десятичная", 10,5},
	{"Шестнадцатиричная", 16,5},
//Константы
	{"Атомная единица массы:кг", 1.660565586E-27,1},
	{"Гравитационная постоянная:Н*м^2/(кг^2)", 6.672041E-11,1},
	{"Заряд электрона:Кл", 1.602189246E-19,1},
	{"Классический радиус электрона:м", 2.81793807E-15,1},
	{"Магнетон Бора:Дж/Тл", 9.274078E-24,1},
	{"Магнитная постоянная:Гн/м", 1.2566370614E-6,1},
	{"Масса атома водорода:а.е.м.", 1.007825036,1},
	{"Масса атома дейтерия:а.е.м.", 2.014101795,1},
	{"Масса покоя электрона:кг", 9.10953447E-31,1},
	{"Масса покоя протона:кг", 1.672648586E-27,1},
	{"Масса покоя нейтрона:кг", 1.6749543E-27,1},
	{"Молярная газовая постоянная:Дж/(моль*К)", 8.31441,1},
	{"Постоянная Авогадро:1/моль", 6.02204531E23,1},
	{"Постоянная Больцмана:Дж/К", 1.38066244E-23,1},
	{"Постоянная Планка:Дж*с", 6.626176E-34,1},
	{"Постоянная Ридберга:1/м", 10973731.77,1},
	{"Постоянная Фарадея:Кл/моль", 96484.56,1},
	{"Скорость света в вакууме:м/с", 299792458,1},
	{"Удельный заряд электрона:Кл/кг", 175880470000,1},
	{"Ускорение свободного падения:м/с^2", 9.80665,1},
	{"Электрическая постоянная:Ф/м", 8.85418781871E-12,1},
	{"Энергия покоя электрона:МэВ", 0.511003414,1},
	{"Энергия покоя протона:МэВ", 938.279627,1},
	{"Энергия покоя нейтрона:МэВ", 939.5731,1}
};

void UpdateUnitName()
{
	char i=CurrentIndex-ID_LEN;
	int ind=0;
	char* buf[50];
	for (char j=0; j<i; j++) ind+=uCount[j];
	SendMessage(GetDlgItem(hMainDlg,IDC_COMBO1),CB_RESETCONTENT,0,0);
	SendMessage(GetDlgItem(hMainDlg,IDC_COMBO2),CB_RESETCONTENT,0,0);
	for (int j=0; j<uCount[i]; j++)
	{
		strcpy((char*)buf,Units[ind+j].name);
		char* ts=strstr((char*)buf,":");
		if (ts) *ts=0;
		SendMessage(GetDlgItem(hMainDlg,IDC_COMBO1),CB_ADDSTRING,0,(LPARAM)buf);
		SendMessage(GetDlgItem(hMainDlg,IDC_COMBO2),CB_ADDSTRING,0,(LPARAM)buf);
	}
	SendMessage(GetDlgItem(hMainDlg,IDC_COMBO1),CB_SETCURSEL,uInit[i],0);
	SendMessage(GetDlgItem(hMainDlg,IDC_COMBO2),CB_SETCURSEL,uInit[i],0);
	CalcResult();
}

void IntToBin(char* buf, int value)
{
	int d=1;
	while (value>=d) d=d<<1;
	if (d!=1) d=d>>1;
	buf[0]=0;
	while (d)
	{
		if ((value&d)==d) strcat(buf,"1");
		else strcat(buf,"0");
		d=d>>1;
	}
}

int BinToInt(char* buf)
{
	int res=0;
	int d=1;
	int i=strlen(buf)-1;
	while (i>=0)
	{
		if (buf[i]=='1') res+=d;
		else if (buf[i]!='0') return 0;
		i--;
		d=d<<1;
	}
	return res;
}

int OctToInt(char* buf)
{
	int res=0;
	int d=1;
	int i=strlen(buf)-1;
	while (i>=0)
	{
		if (buf[i]<'0' || buf[i]>'7') return 0;
		res+=d*(buf[i]-'0');
		d*=8;
		i--;
	}
	return res;
}

int HexToInt(char* buf)
{
	int res=0;
	int d=1;
	CharUpper(buf);
	int i=strlen(buf)-1;
	while (i>=0)
	{
		if (buf[i]>='0' && buf[i]<='9') res+=d*(buf[i]-'0');
		else if (buf[i]>='A' && buf[i]<='F') res+=d*(buf[i]-'A'+10);
		else return 0;
		d*=16;
		i--;
	}
	return res;
}

void CalcResult()
{
	char i=CurrentIndex-ID_LEN;
	int ind=0;
	for (char j=0; j<i; j++) ind+=uCount[j];
	int i1,i2;
	i1=SendMessage(GetDlgItem(hMainDlg,IDC_COMBO1),CB_GETCURSEL,0,0);
	i2=SendMessage(GetDlgItem(hMainDlg,IDC_COMBO2),CB_GETCURSEL,0,0);
	LPUNIT u1,u2;
	u1=(LPUNIT)&Units[ind+i1];
	u2=(LPUNIT)&Units[ind+i2];
	char buf[100];
	if (bFiz)
	{
		sprintf(buf,"%g",u1->value);
		strcat(buf," ");
		char* ts=strstr(u1->name,":");
		if (ts) strcat(buf,ts+1);
		SendMessage(GetDlgItem(hMainDlg,IDC_EDIT1),WM_SETTEXT,0,(LPARAM)buf);
		return;
	}
	SendMessage(GetDlgItem(hMainDlg,IDC_EDIT1),WM_GETTEXT,100,(LPARAM)buf);
	if (strlen(buf))
	{
		double l;
		if (u1->type==5)
		{
			switch ((int)u1->value) // Преобразовываем буффер в
			{						// число
			case 2:
				l=BinToInt(buf);
				break;
			case 8:
				l=OctToInt(buf);
				break;
			case 10:
				l=strtod(buf,NULL);
				break;
			case 16:
				l=HexToInt(buf);
				break;
			}
			switch ((int)u2->value) //Преобразуем число в строку
			{
			case 2:
				IntToBin(buf,(int)l);
				break;
			case 8:
				sprintf(buf,"%o",(int)l);
				break;
			case 10:
				sprintf(buf,"%g",l);
				break;
			case 16:
				sprintf(buf,"%x",(int)l);
				CharUpper(buf);
				break;
			}
		}
		else
		{
			l=strtod(buf,NULL);
			switch (u1->type)
			{
			case 1:
				l=l/u1->value;
				break;
			case 2:
				l=l-u1->value;
				break;
			case 3:
				l=(l-32)*5/9;
				break;
			case 4:
				l=l*5/4;
				break;
			}
			switch (u2->type)
			{
			case 1:
				l=l*u2->value;
				break;
			case 2:
				l=l+u2->value;
				break;
			case 3:
				l=l*9/5+32;
				break;
			case 4:
				l=l*4/5;
				break;
			}
			sprintf(buf,"%g",l);
		}
	}
	SendMessage(GetDlgItem(hMainDlg,IDC_EDIT2),WM_SETTEXT,0,(LPARAM)buf);
}
